app/Http/Controllers/PageController.php

    public function index($page, Request $request)
    {
        if($page == 'members'){
          $members=Member::all();
---
select * from `members`

   public function createMember(Request $request)
   {
    // dd($request);
    $member = Member::create([
        'username'=>$request->username,
        'password'=>$request->password,
        'phone'=>$request->phone,
        'email'=>$request->email,
        'status'=>$request->status,
        'membership_type'=>$request->membership_type,
        ]);

    // return view("pages.members")->with("message",$member->username . " registered successfully");
    $members=Member::all();
---
insert into `members` (`username`, `password`, `phone`, `email`, `status`, `membership_type`, `updated_at`, `created_at`) values ('Benja', '56788904', '34566677888', 'v@gmail.com', 'Inactive', 'Senior', '2023-08-10 16:31:39', '2023-08-10 16:31:39')
select * from `members`