app/Http/Controllers/PageController.php

    public function index($page, Request $request)
    {
        $installments = 12; // You can replace 12 with the actual number of installments
        $interest = 5;
        $totalAppliedAmount = Loan::sum('amount');
---
select * from `loans`